[
    {
        "text": "We are setting up an alias command that will enable you to update your blog with a single command of your choice. The hosting is done on bitbucket, where you can host a single static webpage for free. Similar steps can be followed for github too with appropriate modifications. This write up is using Nodejs format of tiddlywiki. This not a step by step tutorial rather a collection of links that will enable you to achieve the same. Nevertheless no skills are required except the ability to copy and paste to the terminal.\n\n# Create a folder somewhere easily accessible. Name it appropriately, for eg: BlogMaster. The steps assume that you have created it in your home folder. If you have not, modify the paths appropriately.\n# Create a Subfolder and name it \"BlogTiddlers\"\n# Within the folder \"BlogTiddlers\", create your Nodejs TW copying the following commands to terminal.\n     ## Install Nodejs: sudo apt-get install nodejs\n     ## Install tiddlywiki: sudo npm install -g tiddlywiki\n     ## Move to Blog Tiddlers folder: cd /BlogMaster/BlogTiddlers\n     ## Create your tiddlywiki: tiddlywiki index --init server\n     ## Start your tiddlywiki: tiddlywiki index --server\n     ## Open your Browser and type the following address: http://127.0.0.1:8080/\n     ## Add the necessary content for your blog. When you are done, come back to terminal and press Ctrl+C to end the Nodejs instance.\n\n# Now we are setting up the hosting. Go to https://bitbucket.org/ and create and account. Remember to choose your username very carefully - your username is going to be your web address.\n# Follow the instructions given in the following link to set up a temporary webpage: https://confluence.atlassian.com/bitbucket/publishing-a-website-on-bitbucket-cloud-221449776.html.\n     ## If you do not have any experience with creating and cloning repositories, follow this link first: https://confluence.atlassian.com/bitbucket/create-and-clone-a-repository-800695642.html. Once you created and cloned a few repositories for experience, you can go back to the first link to host. For the rest of this write up, I am assuming that you cloned your webpage repository to a folder under your home folder.\n# This step is important, so take your time. Now that we have a bitbucket repository which we can push via terminal, the major throne in our flesh is having to enter your username and password everytime you commit. This can be worked around by changing from https to SSH. A detailed tutorial is found in https://confluence.atlassian.com/bitbucket/set-up-ssh-for-git-728138079.html. Look for the Linux section.\n# Test commiting a few things to your webpage repository after the last step.\n# Now we are building our blog page. Your bitbucket repository clone folder will have a name like yourusername.bitbucket.org. I am assuming that this folder is in your home folder.\n# Copy this command to your terminal: tiddlywiki /BlogMaster/BlogTiddlers --output /yourusername.bitbucket.org --build. This will build your blog and place the static html file in your bitbucket repository folder.\n# Now push it <code>\n     cd /home/yourusername.bitbucket.org\n     git add .\n     git commit -m \"update\"\n     git push\n</code>\n# Check your blog at https://yourusername.bitbucket.io\n# Now for the final part we are creating a script that will automate the whole build-commit-push with a script. Open a text file and copy the following commands to it - and save it as publish.sh <code>\n          tiddlywiki /BlogMaster/BlogTiddlers --output /yourusername.bitbucket.org --build\n          cd /home/yourusername.bitbucket.org\n          git add . || exit 1\n          git commit -m \"update\" || exit 1\n          git push || exit 1 </code>\n# Now you need to call that script with an alias. For that, follow https://bash.cyberciti.biz/guide/Create_and_use_aliases\n",
        "bag": "default",
        "revision": "0",
        "type": "text/vnd.tiddlywiki",
        "title": "Publish Blog with a single command",
        "tags": "Snippets",
        "modifier": "Riz",
        "modified": "20161126125111101",
        "element": "blogpost",
        "creator": "Riz",
        "created": "20161125141148590"
    }
]